:PROPERTIES:
:ID:       BB097FFA-2269-42DC-8411-E6BAE5CFCF5B
:END:
#+title: JavaScript Object Creation


[[id:B178F57B-461C-4AF3-A52E-941A3D72571F][JavaScript]]


*** Object with properties and methods 

#+begin_src js :results output

    // object with properties and methods
  let Person = {
      firstName: "Clyde",
      age: 35,
      message: function() {
          console.log(`${this.firstName} is ${this.age} years old`);
          }
      };
   
  console.log(Person);
  console.log(Person.message());


#+end_src

#+RESULTS:
: { firstName: 'Clyde', age: 35, message: [Function: message] }
: Clyde is 35 years old
: undefined

*** Info

#+begin_src js :results output


  let dog = Object.create(null);
  console.log(dog);

  dog.name = "Fluffy";
  console.log(dog);


#+end_src

#+RESULTS:
: [Object: null prototype] {}
: [Object: null prototype] { name: 'Fluffy' }

*** Object.create() method Example #1

#+begin_src js :results output

  // Dog Object Prototype

  dogProt = {
      woof: function() {
          console.log(this.sound)
      }
  };

  let doggy = Object.create(dogProt);
  console.log(doggy);
  console.log(doggy.woof());

  doggy.sound = 'Ruff';
  console.log(doggy.woof());
  doggy.woof();


  // console.log(dog2.woof());

#+end_src

#+RESULTS:
: [Object: null prototype] {}
: [Object: null prototype] { name: 'Fluffy' }
: {}
: undefined
: undefined
: Ruff
: undefined
: Ruff

*** Object.create() method Example #4

#+begin_src js :results output

  // object.create()
  //   let person = Object.create();
  // Example 2 Practical employee example

  // create company 1 called Dog Factory
  let dogProto = {
      company: "The Dog Factory"
  };

  // create company 2 called Cat Factory
  let catProto = {
      company: "The Cat Factory"
  };

  // create employees
  let employee1 = Object.create(dogProto);
  employee1.name = 'Dennis';

  let employee2 = Object.create(catProto);
  employee2.name = 'Edith';

  console.log(`${employee1.name} works for ${employee1.company}`)
  console.log(`${employee2.name} works for ${employee2.company}`)
  
#+end_src

#+RESULTS:
: Dennis works for The Dog Factory
: Edith works for The Cat Factory


